betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dma.c
/* Private types -------------------------------------------------------------*/
typedef struct
{
  __IO uint32_t ISR;   /*!< DMA interrupt status register */
  __IO uint32_t Reserved0;
  __IO uint32_t IFCR;  /*!< DMA interrupt flag clear register */
} DMA_Base_Registers;

/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup DMA_Private_Constants
 * @{
 */
 #define DAL_TIMEOUT_DMA_ABORT    5U  /* 5 ms */
/**
  * @}
  */
/* Private macros ------------------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/** @addtogroup DMA_Private_Functions
  * @{
  */
static void DMA_SetConfig(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength);
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
static uint32_t DMA_CalcBaseAndBitshift(DMA_HandleTypeDef *hdma);
static DAL_StatusTypeDef DMA_CheckFifoParam(DMA_HandleTypeDef *hdma);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

/**
  * @}
  */

/* Exported functions ---------------------------------------------------------*/
/** @addtogroup DMA_Exported_Functions
  * @{
  */

/** @addtogroup DMA_Exported_Functions_Group1
  *
@verbatim
 ===============================================================================
             ##### Initialization and de-initialization functions  #####
 ===============================================================================
    [..]
    This section provides functions allowing to initialize the DMA Stream source
    and destination addresses, incrementation and data sizes, transfer direction,
    circular/normal mode selection, memory-to-memory mode selection and Stream priority value.
    [..]
    The DAL_DMA_Init() function follows the DMA configuration procedures as described in
    reference manual.

@endverbatim
  * @{
  */

/**
  * @brief  Initialize the DMA according to the specified
  *         parameters in the DMA_InitTypeDef and create the associated handle.
  * @param  hdma Pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Stream.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_Init(DMA_HandleTypeDef *hdma)
{
  uint32_t tmp = 0U;
  uint32_t tickstart = DAL_GetTick();
  DMA_Base_Registers *regs = NULL;

  /* Check the DMA peripheral state */
  if(hdma == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the parameters */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  ASSERT_PARAM(IS_DMA_STREAM_ALL_INSTANCE(hdma->Instance));
#else
  ASSERT_PARAM(IS_DMA_ALL_INSTANCE(hdma->Instance));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  ASSERT_PARAM(IS_DMA_DIRECTION(hdma->Init.Direction));
  ASSERT_PARAM(IS_DMA_PERIPHERAL_INC_STATE(hdma->Init.PeriphInc));
  ASSERT_PARAM(IS_DMA_MEMORY_INC_STATE(hdma->Init.MemInc));
  ASSERT_PARAM(IS_DMA_PERIPHERAL_DATA_SIZE(hdma->Init.PeriphDataAlignment));
  ASSERT_PARAM(IS_DMA_MEMORY_DATA_SIZE(hdma->Init.MemDataAlignment));
  ASSERT_PARAM(IS_DMA_MODE(hdma->Init.Mode));
  ASSERT_PARAM(IS_DMA_PRIORITY(hdma->Init.Priority));
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  ASSERT_PARAM(IS_DMA_CHANNEL(hdma->Init.Channel));
  ASSERT_PARAM(IS_DMA_FIFO_MODE_STATE(hdma->Init.FIFOMode));
  /* Check the memory burst, peripheral burst and FIFO threshold parameters only
     when FIFO mode is enabled */
  if(hdma->Init.FIFOMode != DMA_FIFOMODE_DISABLE)
  {
    ASSERT_PARAM(IS_DMA_FIFO_THRESHOLD(hdma->Init.FIFOThreshold));
    ASSERT_PARAM(IS_DMA_MEMORY_BURST(hdma->Init.MemBurst));
    ASSERT_PARAM(IS_DMA_PERIPHERAL_BURST(hdma->Init.PeriphBurst));
  }

  /* Change DMA peripheral state */
  hdma->State = DAL_DMA_STATE_BUSY;

  /* Allocate lock resource */
  __DAL_UNLOCK(hdma);

  /* Disable the peripheral */
  __DAL_DMA_DISABLE(hdma);

  /* Check if the DMA Stream is effectively disabled */
  while((hdma->Instance->SCFG & DMA_SCFGx_EN) != RESET)
  {
    /* Check for the Timeout */
    if((DAL_GetTick() - tickstart ) > DAL_TIMEOUT_DMA_ABORT)
    {
      /* Update error code */
      hdma->ErrorCode = DAL_DMA_ERROR_TIMEOUT;

      /* Change the DMA state */
      hdma->State = DAL_DMA_STATE_TIMEOUT;

      return DAL_TIMEOUT;
    }
  }

  /* Get the SCFG register value */
  tmp = hdma->Instance->SCFG;

  /* Clear CHSEL, MBCFG, PBCFG, PRILCFG, MEMSIZECFG, PERSIZECFG, MEMIM, PERIM, CIRCMEN, DIRCFG, CTARG and DBM bits */
  tmp &= ((uint32_t)~(DMA_SCFGx_CHSEL | DMA_SCFGx_MBCFG | DMA_SCFGx_PBCFG | \
                      DMA_SCFGx_PRILCFG    | DMA_SCFGx_MEMSIZECFG  | DMA_SCFGx_PERSIZECFG  | \
                      DMA_SCFGx_MEMIM  | DMA_SCFGx_PERIM   | DMA_SCFGx_CIRCMEN   | \
                      DMA_SCFGx_DIRCFG   | DMA_SCFGx_CTARG     | DMA_SCFGx_DBM));

  /* Prepare the DMA Stream configuration */
  tmp |=  hdma->Init.Channel             | hdma->Init.Direction        |
          hdma->Init.PeriphInc           | hdma->Init.MemInc           |
          hdma->Init.PeriphDataAlignment | hdma->Init.MemDataAlignment |
          hdma->Init.Mode                | hdma->Init.Priority;

  /* the Memory burst and peripheral burst are not used when the FIFO is disabled */
  if(hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)
  {
    /* Get memory burst and peripheral burst */
    tmp |=  hdma->Init.MemBurst | hdma->Init.PeriphBurst;
  }

  /* Write to DMA Stream SCFG register */
  hdma->Instance->SCFG = tmp;

  /* Get the FCTRL register value */
  tmp = hdma->Instance->FCTRL;

  /* Clear Direct mode and FIFO threshold bits */
  tmp &= (uint32_t)~(DMA_FCTRLx_DMDEN | DMA_FCTRLx_FTHSEL);

  /* Prepare the DMA Stream FIFO configuration */
  tmp |= hdma->Init.FIFOMode;

  /* The FIFO threshold is not used when the FIFO mode is disabled */
  if(hdma->Init.FIFOMode == DMA_FIFOMODE_ENABLE)
  {
    /* Get the FIFO threshold */
    tmp |= hdma->Init.FIFOThreshold;

    /* Check compatibility between FIFO threshold level and size of the memory burst */
    /* for INCR4, INCR8, INCR16 bursts */
    if (hdma->Init.MemBurst != DMA_MBURST_SINGLE)
    {
      if (DMA_CheckFifoParam(hdma) != DAL_OK)
      {
        /* Update error code */
        hdma->ErrorCode = DAL_DMA_ERROR_PARAM;

        /* Change the DMA state */
        hdma->State = DAL_DMA_STATE_READY;

        return DAL_ERROR;
      }
    }
  }

  /* Write to DMA Stream FCTRL */
  hdma->Instance->FCTRL = tmp;

  /* Initialize StreamBaseAddress and StreamIndex parameters to be used to calculate
     DMA steam Base Address needed by DAL_DMA_IRQHandler() and DAL_DMA_PollForTransfer() */
  regs = (DMA_Base_Registers *)DMA_CalcBaseAndBitshift(hdma);

  /* Clear all interrupt flags */
  regs->IFCR = 0x3FU << hdma->StreamIndex;
#else
  UNUSED(regs);
  UNUSED(tickstart);

  /* calculation of the channel index */
  if ((uint32_t)(hdma->Instance) < (uint32_t)(DMA2_Channel1))
  {
    /* DMA1 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1)) << 2;
    hdma->DmaBaseAddress = DMA1;
  }
  else
  {
    /* DMA2 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA2_Channel1) / ((uint32_t)DMA2_Channel2 - (uint32_t)DMA2_Channel1)) << 2;
    hdma->DmaBaseAddress = DMA2;
  }

  /* Change DMA peripheral state */
  hdma->State = DAL_DMA_STATE_BUSY;

