betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dma.c
  /* Get the CHCFG register value */
  tmp = hdma->Instance->CHCFG;

  /* Clear CHPL, MEMSIZE, PERSIZE, MIMODE, PERIMODE, CIRMODE and DIRCFG bits */
  tmp &= ((uint32_t)~(DMA_CHCFG_CHPL    | DMA_CHCFG_MEMSIZE    | DMA_CHCFG_PERSIZE   | \
                      DMA_CHCFG_MIMODE  | DMA_CHCFG_PERIMODE   | DMA_CHCFG_CIRMODE   | \
                      DMA_CHCFG_DIRCFG));

  /* Prepare the DMA Channel configuration */
  tmp |=  hdma->Init.Direction           |
          hdma->Init.PeriphInc           | hdma->Init.MemInc           |
          hdma->Init.PeriphDataAlignment | hdma->Init.MemDataAlignment |
          hdma->Init.Mode                | hdma->Init.Priority;

  /* Write to DMA Channel CHCFG register */
  hdma->Instance->CHCFG = tmp;

  /* Allocate lock resource */
  __DAL_UNLOCK(hdma);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx ||APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Initialize the error code */
  hdma->ErrorCode = DAL_DMA_ERROR_NONE;

  /* Initialize the DMA state */
  hdma->State = DAL_DMA_STATE_READY;

  return DAL_OK;
}

/**
  * @brief  DeInitializes the DMA peripheral
  * @param  hdma pointer to a DMA_HandleTypeDef structure that contains
  *               the configuration information for the specified DMA Stream.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_DeInit(DMA_HandleTypeDef *hdma)
{
  DMA_Base_Registers *regs = NULL;

  /* Check the DMA peripheral state */
  if(hdma == NULL)
  {
    return DAL_ERROR;
  }

  /* Check the DMA peripheral state */
  if(hdma->State == DAL_DMA_STATE_BUSY)
  {
    /* Return error status */
    return DAL_BUSY;
  }

  /* Check the parameters */
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  ASSERT_PARAM(IS_DMA_STREAM_ALL_INSTANCE(hdma->Instance));
#else
  ASSERT_PARAM(IS_DMA_ALL_INSTANCE(hdma->Instance));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  /* Disable the selected DMA Streamx */
  __DAL_DMA_DISABLE(hdma);

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  /* Reset DMA Streamx control register */
  hdma->Instance->SCFG   = 0U;

  /* Reset DMA Streamx number of data to transfer register */
  hdma->Instance->NDATA = 0U;

  /* Reset DMA Streamx peripheral address register */
  hdma->Instance->PADDR  = 0U;

  /* Reset DMA Streamx memory 0 address register */
  hdma->Instance->M0ADDR = 0U;

  /* Reset DMA Streamx memory 1 address register */
  hdma->Instance->M1ADDR = 0U;

  /* Reset DMA Streamx FIFO control register */
  hdma->Instance->FCTRL  = 0x00000021U;

  /* Get DMA steam Base Address */
  regs = (DMA_Base_Registers *)DMA_CalcBaseAndBitshift(hdma);

  /* Clean all callbacks */
  hdma->XferCpltCallback = NULL;
  hdma->XferHalfCpltCallback = NULL;
  hdma->XferM1CpltCallback = NULL;
  hdma->XferM1HalfCpltCallback = NULL;
  hdma->XferErrorCallback = NULL;
  hdma->XferAbortCallback = NULL;

  /* Clear all interrupt flags at correct offset within the register */
  regs->IFCR = 0x3FU << hdma->StreamIndex;
#else
  (void)regs;

  /* Reset DMA Channel control register */
  hdma->Instance->CHCFG  = 0U;

  /* Reset DMA Channel Number of Data to Transfer register */
  hdma->Instance->CHNDATA = 0U;

  /* Reset DMA Channel peripheral address register */
  hdma->Instance->CHPADDR  = 0U;

  /* Reset DMA Channel memory address register */
  hdma->Instance->CHMADDR = 0U;

  /* calculation of the channel index */
  if ((uint32_t)(hdma->Instance) < (uint32_t)(DMA2_Channel1))
  {
    /* DMA1 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA1_Channel1) / ((uint32_t)DMA1_Channel2 - (uint32_t)DMA1_Channel1)) << 2;
    hdma->DmaBaseAddress = DMA1;
  }
  else
  {
    /* DMA2 */
    hdma->ChannelIndex = (((uint32_t)hdma->Instance - (uint32_t)DMA2_Channel1) / ((uint32_t)DMA2_Channel2 - (uint32_t)DMA2_Channel1)) << 2;
    hdma->DmaBaseAddress = DMA2;
  }

  /* Clear all flags */
  hdma->DmaBaseAddress->INTFCLR = (DMA_INTFCLR_GINTCLR1 << (hdma->ChannelIndex));

  /* Clean all callbacks */
  hdma->XferCpltCallback = NULL;
  hdma->XferHalfCpltCallback = NULL;
  hdma->XferErrorCallback = NULL;
  hdma->XferAbortCallback = NULL;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx ||APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  /* Reset the error code */
  hdma->ErrorCode = DAL_DMA_ERROR_NONE;

  /* Reset the DMA state */
  hdma->State = DAL_DMA_STATE_RESET;

  /* Release Lock */
  __DAL_UNLOCK(hdma);

  return DAL_OK;
}

/**
  * @}
  */

/** @addtogroup DMA_Exported_Functions_Group2
  *
@verbatim
 ===============================================================================
                      #####  IO operation functions  #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Configure the source, destination address and data length and Start DMA transfer
      (+) Configure the source, destination address and data length and
          Start DMA transfer with interrupt
      (+) Abort DMA transfer
      (+) Poll for transfer complete
      (+) Handle DMA interrupt request

@endverbatim
  * @{
  */

/**
  * @brief  Starts the DMA Transfer.
  * @param  hdma       pointer to a DMA_HandleTypeDef structure that contains
  *                     the configuration information for the specified DMA Stream.
  * @param  SrcAddress The source memory Buffer address
  * @param  DstAddress The destination memory Buffer address
  * @param  DataLength The length of data to be transferred from source to destination
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_Start(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_DMA_BUFFER_SIZE(DataLength));

  /* Process locked */
  __DAL_LOCK(hdma);

