betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dma.c
  if(DAL_DMA_STATE_READY == hdma->State)
  {
    /* Change DMA peripheral state */
    hdma->State = DAL_DMA_STATE_BUSY;

    /* Initialize the error code */
    hdma->ErrorCode = DAL_DMA_ERROR_NONE;

    /* Configure the source, destination address and the data length */
    DMA_SetConfig(hdma, SrcAddress, DstAddress, DataLength);

    /* Enable the Peripheral */
    __DAL_DMA_ENABLE(hdma);
  }
  else
  {
    /* Process unlocked */
    __DAL_UNLOCK(hdma);

    /* Return error status */
    status = DAL_BUSY;
  }
  return status;
}

/**
  * @brief  Start the DMA Transfer with interrupt enabled.
  * @param  hdma       pointer to a DMA_HandleTypeDef structure that contains
  *                     the configuration information for the specified DMA Stream.
  * @param  SrcAddress The source memory Buffer address
  * @param  DstAddress The destination memory Buffer address
  * @param  DataLength The length of data to be transferred from source to destination
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_Start_IT(DMA_HandleTypeDef *hdma, uint32_t SrcAddress, uint32_t DstAddress, uint32_t DataLength)
{
  DMA_Base_Registers *regs = NULL;

  DAL_StatusTypeDef status = DAL_OK;

  /* Check the parameters */
  ASSERT_PARAM(IS_DMA_BUFFER_SIZE(DataLength));

  /* Process locked */
  __DAL_LOCK(hdma);

  if(DAL_DMA_STATE_READY == hdma->State)
  {
    /* Change DMA peripheral state */
    hdma->State = DAL_DMA_STATE_BUSY;

    /* Initialize the error code */
    hdma->ErrorCode = DAL_DMA_ERROR_NONE;

    /* Configure the source, destination address and the data length */
    DMA_SetConfig(hdma, SrcAddress, DstAddress, DataLength);

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    regs = (DMA_Base_Registers *)hdma->StreamBaseAddress;
    /* Clear all interrupt flags at correct offset within the register */
    regs->IFCR = 0x3FU << hdma->StreamIndex;

    /* Enable Common interrupts*/
    hdma->Instance->SCFG  |= DMA_IT_TC | DMA_IT_TE | DMA_IT_DME;

    if(hdma->XferHalfCpltCallback != NULL)
    {
      hdma->Instance->SCFG  |= DMA_IT_HT;
    }
#else
    (void)regs;

    hdma->DmaBaseAddress->INTFCLR = DMA_INTFCLR_GINTCLR1 << (hdma->ChannelIndex);

    /* Enable Common interrupts*/
    hdma->Instance->CHCFG  |= DMA_IT_TC | DMA_IT_TE;

    if(hdma->XferHalfCpltCallback != NULL)
    {
      hdma->Instance->CHCFG  |= DMA_IT_HT;
    }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

    /* Enable the Peripheral */
    __DAL_DMA_ENABLE(hdma);
  }
  else
  {
    /* Process unlocked */
    __DAL_UNLOCK(hdma);

    /* Return error status */
    status = DAL_BUSY;
  }

  return status;
}

/**
  * @brief  Aborts the DMA Transfer.
  * @param  hdma   pointer to a DMA_HandleTypeDef structure that contains
  *                 the configuration information for the specified DMA Stream.
  *
  * @note  After disabling a DMA Stream, a check for wait until the DMA Stream is
  *        effectively disabled is added. If a Stream is disabled
  *        while a data transfer is ongoing, the current data will be transferred
  *        and the Stream will be effectively disabled only after the transfer of
  *        this single data is finished.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
  DMA_Base_Registers *regs = NULL;

  uint32_t tickstart = DAL_GetTick();

  if(hdma->State != DAL_DMA_STATE_BUSY)
  {
    hdma->ErrorCode = DAL_DMA_ERROR_NO_XFER;

    /* Process Unlocked */
    __DAL_UNLOCK(hdma);

    return DAL_ERROR;
  }
  else
  {
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    /* Disable all the transfer interrupts */
    hdma->Instance->SCFG  &= ~(DMA_IT_TC | DMA_IT_TE | DMA_IT_DME);
    hdma->Instance->FCTRL &= ~(DMA_IT_FE);

    if((hdma->XferHalfCpltCallback != NULL) || (hdma->XferM1HalfCpltCallback != NULL))
    {
      hdma->Instance->SCFG  &= ~(DMA_IT_HT);
    }

    /* Disable the stream */
    __DAL_DMA_DISABLE(hdma);

    /* Check if the DMA Stream is effectively disabled */
    while((hdma->Instance->SCFG & DMA_SCFGx_EN) != RESET)
    {
      /* Check for the Timeout */
      if((DAL_GetTick() - tickstart ) > DAL_TIMEOUT_DMA_ABORT)
      {
        /* Update error code */
        hdma->ErrorCode = DAL_DMA_ERROR_TIMEOUT;

        /* Change the DMA state */
        hdma->State = DAL_DMA_STATE_TIMEOUT;

        /* Process Unlocked */
        __DAL_UNLOCK(hdma);

        return DAL_TIMEOUT;
      }
    }
    /* calculate DMA base and stream number */
    regs = (DMA_Base_Registers *)hdma->StreamBaseAddress;

    /* Clear all interrupt flags at correct offset within the register */
    regs->IFCR = 0x3FU << hdma->StreamIndex;
#else
    (void)regs;
    UNUSED(tickstart);

    /* Disable DMA IT */
    __DAL_DMA_DISABLE_IT(hdma, (DMA_IT_TC | DMA_IT_HT | DMA_IT_TE));

    /* Disable the channel */
    __DAL_DMA_DISABLE(hdma);

    /* Clear all flags */
    hdma->DmaBaseAddress->INTFCLR = DMA_INTFCLR_GINTCLR1 << (hdma->ChannelIndex);
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

    /* Change the DMA state*/
    hdma->State = DAL_DMA_STATE_READY;

    /* Process Unlocked */
    __DAL_UNLOCK(hdma);
  }
  return DAL_OK;
}

/**
  * @brief  Aborts the DMA Transfer in Interrupt mode.
  * @param  hdma   pointer to a DMA_HandleTypeDef structure that contains
  *                 the configuration information for the specified DMA Stream.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_Abort_IT(DMA_HandleTypeDef *hdma)
{
  if(hdma->State != DAL_DMA_STATE_BUSY)
  {
    hdma->ErrorCode = DAL_DMA_ERROR_NO_XFER;
    return DAL_ERROR;
  }
  else
  {
    /* Set Abort State  */
    hdma->State = DAL_DMA_STATE_ABORT;

    /* Disable the stream */
    __DAL_DMA_DISABLE(hdma);
  }

  return DAL_OK;
}

/**
  * @brief  Polling for transfer complete.
  * @param  hdma          pointer to a DMA_HandleTypeDef structure that contains
  *                        the configuration information for the specified DMA Stream.
  * @param  CompleteLevel Specifies the DMA level complete.
  * @note   The polling mode is kept in this version for legacy. it is recommended to use the IT model instead.
  *         This model could be used for debug purpose.
  * @note   The DAL_DMA_PollForTransfer API cannot be used in circular and double buffering mode (automatic circular mode).
  * @param  Timeout       Timeout duration.
  * @retval DAL status
  */
DAL_StatusTypeDef DAL_DMA_PollForTransfer(DMA_HandleTypeDef *hdma, DAL_DMA_LevelCompleteTypeDef CompleteLevel, uint32_t Timeout)
{
  DAL_StatusTypeDef status = DAL_OK;
  uint32_t mask_cpltlevel;
  uint32_t tickstart = DAL_GetTick();
  uint32_t tmpisr;

