betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_dal_dma.c
  /* calculate DMA base and stream number */
  DMA_Base_Registers *regs = NULL;

  if(DAL_DMA_STATE_BUSY != hdma->State)
  {
    /* No transfer ongoing */
    hdma->ErrorCode = DAL_DMA_ERROR_NO_XFER;
    __DAL_UNLOCK(hdma);
    return DAL_ERROR;
  }

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  /* Polling mode not supported in circular mode and double buffering mode */
  if ((hdma->Instance->SCFG & DMA_SCFGx_CIRCMEN) != RESET)
  {
    hdma->ErrorCode = DAL_DMA_ERROR_NOT_SUPPORTED;
    return DAL_ERROR;
  }

  /* Get the level transfer complete flag */
  if(CompleteLevel == DAL_DMA_FULL_TRANSFER)
  {
    /* Transfer Complete flag */
    mask_cpltlevel = DMA_FLAG_TCIF0_4 << hdma->StreamIndex;
  }
  else
  {
    /* Half Transfer Complete flag */
    mask_cpltlevel = DMA_FLAG_HTIF0_4 << hdma->StreamIndex;
  }

  regs = (DMA_Base_Registers *)hdma->StreamBaseAddress;
  tmpisr = regs->ISR;
#else
  (void)regs;
  UNUSED(tickstart);

  /* Polling mode not supported in circular mode */
  if (RESET != (hdma->Instance->CHCFG & DMA_CHCFG_CIRMODE))
  {
    hdma->ErrorCode = DAL_DMA_ERROR_NOT_SUPPORTED;
    return DAL_ERROR;
  }

  /* Get the level transfer complete flag */
  if(CompleteLevel == DAL_DMA_FULL_TRANSFER)
  {
    /* Transfer Complete flag */
    mask_cpltlevel = __DAL_DMA_GET_TC_FLAG_INDEX(hdma);
  }
  else
  {
    /* Half Transfer Complete flag */
    mask_cpltlevel = __DAL_DMA_GET_HT_FLAG_INDEX(hdma);
  }
  tmpisr = hdma->DmaBaseAddress->INTSTS;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

  while(((tmpisr & mask_cpltlevel) == RESET) && ((hdma->ErrorCode & DAL_DMA_ERROR_TE) == RESET))
  {
    /* Check for the Timeout (Not applicable in circular mode)*/
    if(Timeout != DAL_MAX_DELAY)
    {
      if((Timeout == 0U)||((DAL_GetTick() - tickstart ) > Timeout))
      {
        /* Update error code */
        hdma->ErrorCode = DAL_DMA_ERROR_TIMEOUT;

        /* Change the DMA state */
        hdma->State = DAL_DMA_STATE_READY;

        /* Process Unlocked */
        __DAL_UNLOCK(hdma);

        return DAL_TIMEOUT;
      }
    }

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    /* Get the ISR register value */
    tmpisr = regs->ISR;

    if((tmpisr & (DMA_FLAG_TEIF0_4 << hdma->StreamIndex)) != RESET)
    {
      /* Update error code */
      hdma->ErrorCode |= DAL_DMA_ERROR_TE;

      /* Clear the transfer error flag */
      regs->IFCR = DMA_FLAG_TEIF0_4 << hdma->StreamIndex;
    }

    if((tmpisr & (DMA_FLAG_FEIF0_4 << hdma->StreamIndex)) != RESET)
    {
      /* Update error code */
      hdma->ErrorCode |= DAL_DMA_ERROR_FE;

      /* Clear the FIFO error flag */
      regs->IFCR = DMA_FLAG_FEIF0_4 << hdma->StreamIndex;
    }

    if((tmpisr & (DMA_FLAG_DMEIF0_4 << hdma->StreamIndex)) != RESET)
    {
      /* Update error code */
      hdma->ErrorCode |= DAL_DMA_ERROR_DME;

      /* Clear the Direct Mode error flag */
      regs->IFCR = DMA_FLAG_DMEIF0_4 << hdma->StreamIndex;
    }
#else
    tmpisr = hdma->DmaBaseAddress->INTSTS;
    if((tmpisr & (DMA_INTFCLR_TERRCLR1 << hdma->ChannelIndex)) != RESET)
    {
      /* Update error code */
      hdma->ErrorCode |= DAL_DMA_ERROR_TE;

      /* Clear the transfer error flag */
      hdma->DmaBaseAddress->INTFCLR = DMA_INTFCLR_TERRCLR1 << hdma->ChannelIndex;
    }
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  }

  if(hdma->ErrorCode != DAL_DMA_ERROR_NONE)
  {
    if((hdma->ErrorCode & DAL_DMA_ERROR_TE) != RESET)
    {
      DAL_DMA_Abort(hdma);

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
      /* Clear the half transfer and transfer complete flags */
      regs->IFCR = (DMA_FLAG_HTIF0_4 | DMA_FLAG_TCIF0_4) << hdma->StreamIndex;
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

      /* Change the DMA state */
      hdma->State= DAL_DMA_STATE_READY;

      /* Process Unlocked */
      __DAL_UNLOCK(hdma);

      return DAL_ERROR;
   }
  }

  /* Get the level transfer complete flag */
  if(CompleteLevel == DAL_DMA_FULL_TRANSFER)
  {
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    /* Clear the half transfer and transfer complete flags */
    regs->IFCR = (DMA_FLAG_HTIF0_4 | DMA_FLAG_TCIF0_4) << hdma->StreamIndex;
#else
    /* Clear the transfer complete flag */
    __DAL_DMA_CLEAR_FLAG(hdma, __DAL_DMA_GET_TC_FLAG_INDEX(hdma));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */

    hdma->State = DAL_DMA_STATE_READY;

    /* Process Unlocked */
    __DAL_UNLOCK(hdma);
  }
  else
  {
#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
    /* Clear the half transfer and transfer complete flags */
    regs->IFCR = (DMA_FLAG_HTIF0_4) << hdma->StreamIndex;
#else
    /* Clear the transfer complete flag */
    __DAL_DMA_CLEAR_FLAG(hdma, __DAL_DMA_GET_HT_FLAG_INDEX(hdma));
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
  }

